<template lang="pug">
.block-5.p-1
  .container-full.bg-shape
    .container
      .block-5__wrapper.flex-column
        TitleInBlock(title="Частые вопросы")
        .block-5__content
            accordion(:items="accordionItems" )



</template>

<script>

//import Form from "@/components/Utilities/form-default.vue";

import TitleInBlock from "./title-in-block";
import Accordion from "../../Elements/Accordion/AccordionDefault";

export default {
  name: "Block_5",
  components: {
      Accordion,
      TitleInBlock
  },
  method: {},
  data: () => ({
    accordionItems: [
      {
        id: 1,
        title: "У меня плохая кредитная история. Смогу ли я получить деньги?",
        content:
          "Кредитная история учитывается при анализе заявки на кредит, но не всегда является решающим фактором. Вы можете получить деньги, даже имея задолженность перед другими финансовыми учреждениями.",
        isopen: false,
      },
      {
        id: 2,
        title: "Почему лучше через вас, а не в банк напрямую?",
        content:
          "Наш сервис помогает экономить время на подачи заявки в разных финансовых учреждениях. Она автоматически рассылается во банки-партнеры, которых уже больше 100. Плюс для наших клиентов кредитные организации предлагают эксклюзивные условия со сниженными ставками и другими преимуществами.",
        isopen: false,
      },
      {
        id: 3,
        title: "Как работает ваш сервис?",
        content:
          "После заполнения заявки она автоматически отправляется сразу в 150 банков-партнеров. Они проверяют ее и направляют свое решение вам по СМС. После одобрения заявки вам остается только выбрать самые выгодные условия кредитования, заключить договор и получить деньги удобным способом.",
        isopen: false,
      },
      {
        id: 4,
        title: "Как быстро я смогу получить деньги?",
        content:
          "Все заявки, поданные через наш сервис, рассматриваются в приоритетном порядке. Первое решение вы получите уже через 3 минуты. На оформление договора и получение денег потребуется еще от 5 минут до 1 дня.",
        isopen: false,
      },
      {
        id: 5,
        title: "Можно ли получить кредит без справок?",
        content:
          "Наши банки-партнеры понимают, что не всегда возможно быстро получить справки от работодателя. Они готовы выдавать кредиты без подтверждения дохода, залогов и поручителей. Смело заполняйте онлайн-заявку и получайте деньги.",
        isopen: false,
      },
      {
        id: 6,
        title: "Можно ли вернуть деньги досрочно?",
        content:
          "Погасить кредит досрочно можно любым удобным способом: наличными, банковским переводом или электронным платежом. Проценты при этом пересчитают и возьмут только за фактическое время пользования заемными деньгами.",
        isopen: false,
      },
      {
        id: 7,
        title: "С какими городами вы работаете?",
        content:
          "Мы работаем с клиентами из городов, поселков и других населенных пунктов любых регионов России. Современные технологии позволяют легко получать кредиты даже тем, кто живет вдали от мегаполисов.",
        isopen: false,
      },
    ],
  }),
  mounted() {
  },
};
</script>

<style lang="scss" scoped>
//@import "@/assets/scss/project/mixins.scss";
.title {
  margin-bottom: 30px;
  padding-top: 50px;
}
</style>
