<template lang="pug">
.window__content
  .window__top
      TitleBlock(title="О себе")
  .window__body
    .txt.txt-black Мой путь в Frontend.
    .txt.txt-black Я начал заниматься кодингом еще будучи подростком, но в качестве хобби. Создавал, поддерживал сайты небольшой сложности для знакомых или в качестве "доп заработка" по основной работе. Затем начал создавать приложения на андроиде (небольшие утилиты, и затем простенькие игры). Потом меня, абсолютно случайно, затянуло в сферу SEO. В ходе общения со специалистами, и по работе, заново взглянул на верстку сайтов и вспомнив радость из "детства" решил занятся версткой всерьез. Получил весьма позитивный опыт на бирже фриланса, хоть биржа мне не особо понравилась, я понял, что хочу совершенствоваться больше в сторону верстки и Frontend разработки. Впервые, работа приносила большую радость. Спустя десятки сайтов различной сложности, мои навыки уперлись в стену, и открыл для себя VUE. И тут вспомнились навыки создания приложений, и снова все заиграло яркими красками :)
  .window__footer


</template>

<script>
//import XXX from "@/components/XXX.vue";
export default {
  name: "About",
  components: {},
  data: () => ({}),
  created() {},
  mounted() {},
  unmounted() {},
  methods: {},
};
</script>

<style lang="scss" scoped>
//@import "@/assets/scss/project/mixins.scss";
</style>
