<template lang="pug">
.window__content
    .window__top
        TitleBlock(title="Добро пожаловать!")
    .window__body
        .txt.txt-black Это PWA, созданное с помощью VUE. Сейчас оно находится в процессе разработки :) В планах наполнение контентом, добавление новых функций, улучшение внешнего вида, изменение текстов, рефакторинг повторяющегося кода по vue компонентам, адаптация под разные брейкпоинты экрана, улучшение функционала PWA, смена роутера на замену активного компонента(?), перенаправление со страницы с ошибкой.
        .txt.txt-black Если вы уже заходили на сайт, то уже не увидите интро, но вы можете посмотреть его снова, нажав на кнопку ниже
        button.btn(@click="$store.commit('SHOW_INTRO')")
            .txt-black Показать интро
        .txt.txt-black.txt-small Кстати, все буквы появляются в случайном порядке каждый раз! Вы заметили кнопку пропуска справа сверху?
    .window__footer
        .txt.txt-black 👈  Это переключатели внешнего вида приложения, можете поэкспериментировать)


</template>

<script>
//import XXX from "@/components/XXX.vue";
export default {
  name: "Welcome",
  components: {},
  data: () => ({}),
  created() {},
  mounted() {},
  unmounted() {},
  methods: {},
};
</script>

<style lang="scss" scoped>
@import "@/assets/scss/project/mixins.scss";
button.btn {
    cursor: pointer;
    padding: 8px 12px;
    border: 1px solid black;
}
.window {
  &__content {
    height: 100%;
    min-height: 70vh;
    display: flex;
    flex-direction: column;
      button,.txt{
          margin-bottom: 1em;
      }

  }
  &__top {
    height: 120px;
  }
  &__body {
    flex-grow: 1;
  }
  &__footer {
    margin-top: auto;
      padding-top: 2em;
  }
}
</style>
